//#include<stdio.h>
//
//int main()
//{
//	/*
//	if的格式:
//	if (条件) {
//		语句体
//		}
//	*/
//	////练习1:人物最大血量是200,受到80的伤害,之后得到100的恢复
//	//int a = 200;
//	//int b = 80;
//	//int c = 100;
//	//a = a - b + c;
//	//if (a>=200) {
//	//	a = 200;
//	//}
//	//printf("%d\n", a);
//
//	/*
//	if语句的细节1:
//	if语句在条件判断的可以参考0和1(非0数)
//	其中0和1的判断就是程序执行判断
//	if语句的细节2:
//	在使用if语句的时候,if语句的语句体只有一句话的时候
//	可以直接省略{}不写,但是在平时开发过程中,不需要这样操作
//	*/
//
//	/*
//	else if语句的用法:
//
//	if (判断条件) {
//		语句体A;
//		}else if{
//		语句体B;
//		}
//	*/
//	////练习2:测试好感度,如果好感度大于60,则输出中意,如果小于60,则输出不中意
//	//int a;
//	//printf("请输入一个任意的数字:");
//	//scanf("%d", &a);
//	//if (a < 60) {
//	//	printf("不中意");
//	//}
//	//else if (a > 60) {
//	//	printf("中意");
//	//}
//
//	//练习2:你和你的好朋友去看电影,如果挨着一起,则会开心看电影
//	// 如果不在一起则会开心打游戏
//	//int rowA = 5;
//	//int rowB = 5;
//	//int numA = 6;
//	//int numB = 5;
//	////方法1:
//	//if (rowA == rowB) {
//	//	if (numA - numB == 1 || numB - numA == 1) {
//	//		printf("我会开心的陪着看电影!");
//	//	}else if(1){
//	//		printf("我会开心的打游戏!");
//	//	}
//	//}
//	//else if(1){
//	//	printf("我会开心的打游戏!");
//	//}
//
//	////方法2:
//	//if ((rowA == rowB) && (numA - numB == 1 || numB - numA == 1)) {
//	//	printf("我会开心的看电影!");
//	//}
//	//else if (1) {
//	//	printf("我会开心的打游戏!");
//	//}
//
//	//嵌套else if
//	//练习1:根据充值的不同金额,判断贵族等级
//	/*
//	1~99:VIP1
//	100~499:VIP2
//	500~999:VIP3
//	1000~1999:VIP4
//	2000~5000:VIP5
//	*/
//	//int a;
//	//printf("请输入充值金额:");
//	//scanf("%d", &a);
//	//if (a == 0) {
//	//	printf("零充玩家");
//	//}
//	//else if (a <= 99 && 1 <= a) {
//	//	printf("VIP1");
//	//}
//	//else if (a <= 499 && 100 <= a) {
//	//	printf("VIP2");
//	//}
//	//else if (a <= 999 && 500 <= a) {
//	//	printf("VIP3");
//	//}
//	//else if (a <= 1999 && 1000 <= a) {
//	//	printf("VIP4");
//	//}
//	//else if (a <= 5000 && 2000 <= a) {
//	//	printf("VIP5");
//	//}
//	
//
//	//练习1:期末考试成绩以等级的形式公布:
//	/*
//	总分:100分
//	A:85~100
//	B:70~84
//	C:60~69
//	D:0~59
//	*/
//	double a;
//	printf("请输入你的成绩:");
//	scanf("%lf", &a);
//	if (a < 0 || a >= 100) {
//		printf("成绩无效!");//直接判断分数,节约运算时间
//	}
//	else if (a <= 100 && a >= 85) {
//		printf("你的成绩等级是:A");
//	}
//	else if (a < 85 && a >= 70) {
//		printf("你的成绩等级是:B");
//	}
//	else if (a < 70 && a >= 60) {
//		printf("你的成绩等级是:C");
//	}
//	else {
//		printf("你的成绩等级是:D");
//	}
//
//
//	return 0;
//
//}
