//#include<stdio.h>
//
//int main() 
//{
//	/*
//	for循环的基本格式:
//		for (初始化语句1;条件判断语句2;条件控制语句3) 
//		{
//		循环体4
//		}
//		循环过程:
//		第一次循环:1,2,4,3
//		第二次循环:2,4,3
//		第三次循环:2,4,3
//		第四次循环:2,4,3
//		第五次循环:2,4,3
//		第六次循环:2
//	*/
//	////练习1:输出自己的名字五遍
//	////方法一:
//	//int i;
//	//for (i = 0; i < 6; i++) {
//	//	printf("阿木\n");
//	//}
//	////方法二:
//	//for (int u = 0; u < 6; u++) {
//	//	printf("阿木\n");
//	//}
//
//
//	////练习2:问一个朋友是否可以成为好朋友
//	//for (int y = 0; y < 11; y++) {
//	//	printf("阿某,可以成为我的好朋友嘛?\n");
//	//}
//
//
//	////练习3:输出1~5和5~1
//	//for (int num1 = 1; num1 < 6; num1++) {
//	//	printf("%d\n",num1);
//	//}
//	//for (int num2 = 5; num2 > 0; num2--) {
//	//	printf("%d\n",num2);
//	//}
//	//printf("======================\n");
//
//
//	////练习4:输出1~5且求出1~5的和
//	//int sum1 = 0;
//	//for (int num3 = 1; num3 < 6; num3++) {
//	//	printf("%d\n", num3);
//	//	sum1 = sum1 + num3;
//	//}
//	//printf("%d\n", sum1);
//	// 关于将变量定义在括号外面和里面的关系
//	// 如果变量需要保存,则需要将变量放在括号外面
//	// 如果变量每次使用都是要全新的,那么可以将变量设置在括号里面
//	// 变量的生命周期:一个{}就是一个变量的周期
//	//printf("================\n");
//
//
//	////练习5:输出1~100之间的偶数的和
//	//int sum2 = 0;
//	//for (int num4 = 1; num4 <= 100; num4++) {
//	//	if (num4 % 2 == 0) {
//	//		sum2 = sum2 + num4;
//	//	}
//	//	else {
//	//		continue;
//	//	}
//	//}
//	//printf("%d\n", sum2);
//
//	////求奇数和eg:
//	//int sum2 = 0;
//	//for (int num4 = 1; num4 <= 100; num4++) {
//	//	if (num4 % 2 != 0) {
//	//		sum2 = sum2 + num4;
//	//	}
//	//}
//	//printf("%d\n", sum2);
//
//
//	////练习6:键盘录入两个数字表示范围,既可以被8整除也可以被6整除
//	//int num5;
//	//int num6;
//	//int count = 0;
//	//printf("请任意输入两个数字:\n");
//	//scanf("%d %d", &num5, &num6);
//	//if (num5 > num6) {
//	//	for (int a = num6; a <= num5; a++) {
//	//		if (a % 8 == 0 && a % 6 == 0) {
//	//			count++;
//	//		}
//	//	}
//	//}
//	//else {
//	//	for (int a = num5; a <= num6; a++) {
//	//		if (a % 8 == 0 && a % 6 == 0) {
//	//			count++;
//	//		}
//	//	}
//	//}
//	//printf("%d\n", count);
//
//	
//	int num1;
//	int num2;
//	int count = 0;
//	printf("请输入任意的两个数字:\n");
//	scanf("%d %d", &num1, &num2);
//	int min = num1 < num2 ? num1 : num2;
//	int max = num1 > num2 ? num1 : num2;
//	for (int i = min; i <= max; i++) {
//		if (i % 6 == 0 && i % 8 == 0) {
//			count++;
//		}
//	}
//	printf("%d\n", count);
//
//
//	return 0;
//}