//#include<stdio.h>
//
//int main()
//{
//	// +-*:
//	//整数:
//	printf("%d\n", 1 + 2);
//	printf("%d\n", 1 - 2);
//	printf("%d\n", 1 * 2);
//
//	//小数:
//	printf("%.2lf\n", 1.1 + 1.02);
//	printf("%.2lf\n", 1.1 - 1.02);
//	printf("%.2lf\n", 1.1 * 1.02);
//
//
//	//使用变量
//	int a = 10;
//	int b = 12;
//	
//	printf("%d\n", a + b);
//	printf("%d\n", a - b);
//	printf("%d\n", a * b);
//
//
//	// /%:
//	
//	printf("%d\n", 10 / 5);
//	printf("%d\n",10 % 3);
//
//
//
//	//计算的通用规则
//	//1.整数和整数一定是整数:
//	printf("%d\n", 10 / 2);
//	//2.整数和小数一定是小数;
//	printf("%.2lf\n", 10 / 2.5);
//	//3.小数和小数一定是小数
//	printf("%.2lf\n", 10.0 / 2.5);
//	//4.小数和小数结果不一定准确
//	printf("%.20lf\n", 10 / 3);
//
//	//关于除法细节
//	//不可以将0当作除数
//
//	//关于取余细节
//	//1.必须全部是整数
//	//2.取余的值的符号取决于被取余数
//	//3.不可以将0当作取余数
//
//
//	//练习1:对任意的三位数挑出个十百位
//	int num;
//	printf("请输入一个任意的三位数:");
//	scanf("%d", &num);
//	printf("你输入的三位数的个位是:%d,", num % 10);
//	printf("你输入的三位数的十位是:%d,", num / 10 % 10);
//	printf("你输入的三位数的百位是:%d.", num / 100);
//
//	return 0;
//
//}