//#include<stdio.h>
//
//int main()
//
//{
//
//	////自增和自减运算符:++a,--a
//
//	//int a = 0;
//	//a++;//当自增和自减运算符单独一行的时候,那么符号位置不重要
//	//++a;
//	//a--;
//	//--a;
//	//printf("%d\n", a);
//
//	////自增和自减运算符综合练习:
//	////练习1:
//	//int a = 0;
//	//int b = a++;//先用后加
//	//int c = ++a;//先加后用
//	//printf("%d\n", b);
//	//printf("%d\n", c);
//	
//	//练习2:
//	//int a = 10;
//	//int b = 5;
//	//int c = a++ + ++a - --b - a--;
//	////		 11   11    4     11
//	//// 前缀优先于后缀,即前缀计算完成之后再去计算后缀
//	//// 前缀和后缀的数值分开计算
//	////在计算之中,符号在前面的自增,是先加后用
//	///*
//	//int a = 10;
//	//printf("%d\n",++a + ++a);
//	//			   12 + 12
//	//输出的就是24
//	//*/
//	////符号在后面的自增,则就是先用后加
//	///*
//	//int a = 10;
//	//printf("%d\n",a++ + a++);
//	//			  10  +  10
//	//输出的就是20,但是此时的a=12
//	//*/
//	//printf("%d\n", c);
//
//	//Linux和mac计算方法:
//	/*
//	在Linux和mac系统当中,计算的顺序是由左向右,每个计算步骤是独立存在的
//	eg:
//	int a = 10;
//	printf("%d\n",a++ + ++a);
//				   11+   11
//	输出就是22,但是此时的a=12
//	*/
//
//	//练习3:
//	//int a = 10;
//	//int k1 = a++ + a++;
//	///*
//	//10+10=20
//	//*/
//	//int k2 = ++a + ++a;
//	///*
//	//14+14=28
//	//*/
//	//int k3 = ++a + a++;
//	///*
//	//15+15=30
//	//*/
//	//int k4 = a++ + ++a;
//	///*
//	//17+17=34
//	//*/
//	//printf("%d\n", k1);
//	//printf("%d\n", k2);
//	//printf("%d\n", k3);
//	//printf("%d\n", k4);
//
//	//练习4:
//	//int a = 10;
//	//int k1 = a++ + a++ + a;
//	//int k2 = ++a + ++a + a;
//	//int k3 = ++a + a++ + a;
//	//int k4 = a++ + ++a + a;
//	//printf("%d\n", k1);//30,a=12
//	//printf("%d\n", k2);//42,a=14
//	//printf("%d\n", k3);//45,a=16
//	//printf("%d\n", k4);//51,a=18
//
//
//	////赋值运算符
//	////+=
//	//int a = 10;
//	//int b = 20;
//	//a += b;
//	//printf("%d\n", a);
//	//printf("%d\n", b);
//
//	////-=
//	//int a = 10;
//	//int b = 20;
//	//a -= b;
//	//printf("%d\n", a);
//	//printf("%d\n", b);
//
//	////*=
//	//int a = 10;
//	//int b = 20;
//	//a *= b;
//	//printf("%d\n", a);
//	//printf("%d\n", b);
//
//	//%=
//	//int a = 10;
//	//int b = 20;
//	//a %= b;
//	//printf("%d\n", a);
//	//printf("%d\n", b);
//
//
//	//关系运算符:
//	
//	/*
//	==:表示判断相等
//	!=:表示判断不相等
//	>:表示判断大于
//	>=:表示判断大于等于
//	<:表示判断小于
//	<=:表示判断小于等于
//	*/
//
//	////练习1:判断一个数是否为偶数
//	//int a = 10;
//	//printf("%d\n", a % 2 == 0);
//
//	////练习2:判断一个数字不超过100
//	//int a = 99;
//	//printf("%d\n", a <= 100);
//
//	////练习3:手机余额和需要支付商品的价钱比较
//	//double a = 200.0;
//	//double b = 150.4;
//	//printf("%d\n", a >= b);
//
//	////练习4:在出货商品的时候,对于订单数量和库存的比较
//	//int buy = 57;
//	//int wares = 70;
//	//printf("%d\n", buy <= wares);
//	
//	////练习5:在购买原材料的时候,单价不小于100元的
//	//double a = 79.8;
//	//printf("%d\n", a <= 100);
//
//
//	//逻辑运算符
//	//在逻辑运算符中,有短路效果
//	//在&&中,如果第一个判断条件判断为0,则出现短路,不用判断第二个条件
//
//	/*
//	与运算(&&):两者必须全部满足
//	在账号登陆的时候,我们不仅需要输入正确的账号,同时还需要输入正确的密码
//	*/
//
//	/*
//	或运算(||):两者只需要满足其中一个条件即可
//	在账号登陆的时候,我们只需要输入密码登陆或者我们扫码登陆
//	*/
//
//	/*
//	非运算(!):直接取相反的结果
//	*/
//	
//	//练习1:表达20>=a>=10;
//	//   (10<=a)&&(a<=20)
//
//	//练习2:写一个表达式与题目意思相同
//	//1.!(x>0)
//	//printf("%d\n",x<=0);
//	//2.a<3||a>3;
//	//printf("%d\n",a!=3);
//
//	////练习3:键盘输出一个两位整数,不包含7则输出1
//	// 方法1:
//	//int a = 71;
//	//if (a % 10 != 7) {
//	//	if (a % 70 >= 10) {
//	//		printf("%d\n", 1);
//	//	}
//	//	else if (a % 70 <= 10) {
//	//		printf("%d\n", 0);
//	//	}
//	//}
//	//else if (a % 10 == 7) {
//	//	printf("%d\n", 0);
//	//}
//	
//	////方法2:
//	////1.使用键盘录入
//	//int a;
//	//printf("请输入一个两位数:");
//	//scanf("%d", &a);
//	//
//	////2.判断输入数据是否满足条件
//	//int ge = a % 10;
//	//int shi = a / 10 % 7;
//	//printf("最终的结果:%d", ge != 7 && shi != 1);
//
//
//
//
//	////练习4:在上一题的基础上,a值不可以是7的倍数
//	//int a = 14;
//	//if (a % 7 == 0) {
//	//	printf("%d\n", 0);
//	//}
//	//else if (a % 7 != 0) {
//	//	if (a % 10 != 7) {
//	//		if (a % 70 >= 10) {
//	//			printf("%d\n", 1);
//	//		}
//	//		else if (a % 70 <= 10) {
//	//			printf("%d\n", 0);
//	//		}
//	//	}
//	//	else if (a % 10 == 7) {
//	//		printf("%d\n", 0);
//	//	}
//	//}
//
//	//方法2:
//	////1.使用键盘录入
//	//int a;
//	//printf("请输入一个两位数:");
//	//scanf("%d", &a);
//	//
//	////2.判断输入数据是否满足条件
//	//int ge = a % 10;
//	//int shi = a / 10 % 7;
//	//int col = a % 7;
//	//printf("最终的结果:%d", ge != 7 && shi != 1 && col != 0);
//
//
//	//三元运算符
//	//int a = 10;
//	//int b = 10;
//	//int c = 20;
//	//printf("最大值是:%d\n", a > b ? a : b && b > c ? b : c);
//
//
//	//方法:
//	//int a = 10;
//	//int b = 20;
//	//int c = 30;
//	//int d = a > b ? a : b;
//	//int e = b > c ? b : c;
//	//printf("%d\n", d > e ? d : e);
//
//	
//	//逗号运算符
//	//int a = 10;
//	//printf("%d\n", (a++, ++a, --a, a++));
//
//	//现在有一个数,首先对它取绝对值,然后除以三获取余数之后再乘十
//	//方法一:
//	//int b = -17;
//	//b = b > 0 ? b : -b;
//	//b %= 3;
//	//b *= 10;
//	//printf("%d\n", b);
//	//方法二:
//	//int b = -17;
//	//printf("%d\n", (b = b > 0 ? b : -b, b %= 3, b *= 10));
//	
//
//	//运算符的优先级：（一元>二元>三元）
//	/*
//	一元:
//	()
//	++,--
//	+,-,!(正号和负号)
//	二元:
//	*,/,%
//	+,-
//	>,>=,<,<=
//	==,!=
//	&&
//	||
//	三元:
//	?:
//	赋值运算符:
//	=,*=,/=,%=+=,-=
//	,(逗号运算符)
//	*/
//
//	//结合运算符的优先级去解题
//	//练习1:
//	int a = 3;
//	int b = 4;
//	int c = 5;
//	int num = !((a < b) && !c || a < b);
//	printf("%d\n", num);
//
//
//	return 0;
//
//}
